namespace Linguistics.Data;

/// <summary>
/// Contains data for "Weak" roots (roots containing Waw or Yah).
/// Organized by position (First, Middle, Last) to support specific morphological rules.
/// </summary>
public static class ArabicWeaksData
{
    #region First

    public static readonly HashSet<string> FirstWaw = new()
    {
        "أد" , "أر" , "أل" , "أم" , "بأ" , "بخ" , "بر" , "بش" , "بق" , "بل" , "به" , "تد" , "تر" , "تن" , "تي" , "ثأ" , "ثب" ,
        "ثر" , "ثق" , "ثل" , "ثن" , "جب" , "جد" , "جر" , "جز" , "جس" , "جع" , "جف" , "جق" , "جل" , "جم" , "جن" , "جه" , "حد" ,
        "حش" , "حف" , "حل" , "حم" , "حي" , "خز" , "خط" , "خم" , "خي" , "دج" , "دد" , "در" , "دع" , "دق" , "دك" , "دي" , "ذر" ,
        "رب" , "رث" , "رد" , "رس" , "رش" , "رط" , "رع" , "رف" , "رق" , "رك" , "رل" , "رم" , "رن" , "ري" , "زب" , "زر" , "زز" ,
        "زع" , "زل" , "زن" , "زي" , "سخ" , "سد" , "سط" , "سع" , "سق" , "سل" , "سم" , "سن" , "سي" , "شب" , "شج" , "شح" , "شر" ,
        "شع" , "شق" , "شك" , "شل" , "شم" , "شن" , "شي" , "صب" , "صد" , "صف" , "صل" , "صم" , "صي" , "ضأ" , "ضب" , "ضح" , "ضر" ,
        "ضع" , "ضم" , "طأ" , "طب" , "طد" , "طر" , "طس" , "طش" , "طف" , "طن" , "طي" , "ظب" , "ظف" , "عب" , "عث" , "عد" , "عر" ,
        "عز" , "عس" , "عظ" , "عق" , "عك" , "عل" , "عي" , "غد" , "غر" , "غل" , "غي" , "فد" , "فر" , "فز" , "فض" , "فع" , "فق" ,
        "في" , "قب" , "قت" , "قح" , "قد" , "قذ" , "قر" , "قص" , "قظ" , "قع" , "قف" , "قق" , "قل" , "قن" , "قي" , "كأ" , "كب" ,
        "كد" , "كر" , "كز" , "كس" , "كع" , "كف" , "كل" , "كم" , "كن" , "كي" , "لج" , "لد" , "لس" , "لط" , "لع" , "لغ" , "لف" ,
        "لم" , "له" , "لو" , "لي" , "مأ" , "مد" , "مس" , "مض" , "مق" , "نن" , "ني" , "هب" , "هج" , "هد" , "هر" , "هق" , "هل" ,
        "هم" , "هن" , "هي" , "يب" , "يل"
    };

    public static readonly HashSet<string> FirstYah = new()
    {
        "أس" , "بب" , "بس" , "تم" , "ثق" , "حر" , "خت" , "خن" , "رع" , "رق" , "زب" , "سر" , "سن" , "فخ" , "فع" , "قت" , "قظ" ,
        "قن" , "مم" , "من" , "نع" , "ود" , "وم"
    };

    #endregion First

    #region Middle

    public static readonly HashSet<string> MidWaw = new()
    {
        "أب" , "أج" , "أد" , "أر" , "أز" , "أش" , "أض" , "أف" , "أق" , "أل" , "أن" , "أه" , "أي" ,

        "بب" , "بت" , "بح" , "بخ" , "بر" , "بز" , "بس" , "بش" , "بص" , "بغ" , "بق" , "بل" ,

        "تب" , "تج" , "تق" , "ته" ,

        "ثب" , "ثر" , "ثل" , "ثي" ,

        "جب" , "جح" , "جد" , "جر" , "جز" , "جس" , "جط" , "جع" , "جف" , "جق" , "جل" , "جن" , "جو" , "جي" ,

        "حب" , "حت" , "حث" , "حج" , "حد" , "حذ" , "حر" , "حز" , "حس" , "حش" , "حص" , "حض" , "حط" , "حف" , "حق" , "حك" , "حل" , "حم" , "حي" ,

        "خج" , "خخ" , "خذ" , "خر" , "خص" , "خض" , "خف" , "خل" , "خن" , "خو" , "خي" ,

        "دأ" , "دب" , "دح" , "دخ" , "دد" , "در" , "دس" , "دش" , "دط" , "دغ" , "دف" , "دق" , "دك" , "دل" , "دم" , "دن" , "دي" ,

        "ذب" , "ذد" , "ذق" , "ذي" ,

        "رب" , "رث" , "رج" , "رح" , "رد" , "رز" , "رس" , "رض" , "رع" , "رغ" , "رق" , "رل" , "رم" , "ري" ,

        "زج" , "زح" , "زد" , "زر" , "زغ" , "زق" , "زل" , "زم" , "زن" , "زي" ,

        "سأ" , "سج" , "سح" , "سخ" , "سد" , "سر" , "سس" , "سط" , "سع" , "سغ" , "سف" , "سق" , "سك" , "سل" , "سم" , "سي" ,

        "شب" , "شح" , "شر" , "شش" , "شط" , "شظ" , "شف" , "شق" , "شك" , "شل" , "شم" , "شن" , "شه" , "شي" ,

        "صب" , "صت" , "صج" , "صح" , "صخ" , "صر" , "صص" , "صع" , "صغ" , "صف" , "صل" , "صم" , "صن" ,

        "ضأ" , "ضج" , "ضر" , "ضع" , "ضي" ,

        "طب" , "طح" , "طد" , "طر" , "طس" , "طش" , "طع" , "طف" , "طق" , "طل" , "طي" ,

        "عج" , "عد" , "عذ" , "عر" , "عز" , "عص" , "عض" , "عف" , "عق" , "عل" , "عم" , "عن" , "عه" , "عي" ,

        "غأ" , "غث" , "غر" , "غز" , "غش" , "غص" , "غط" , "غغ" , "غل" , "غي" ,

        "فت" , "فج" , "فح" , "فد" , "فر" , "فز" , "فض" , "فط" , "فع" , "فف" , "فق" , "فل" , "فه" ,

        "قب" , "قت" , "قح" , "قد" , "قر" , "قس" , "قش" , "قص" , "قض" , "قط" , "قع" , "قق" , "قل" , "قم" , "قن" , "قه" , "قي" ,

        "كب" , "كخ" , "كد" , "كر" , "كز" , "كس" , "كش" , "كع" , "كف" , "كك" , "كم" , "كن" , "كي" ,

        "لب" , "لث" , "لج" , "لح" , "لذ" , "لز" , "لس" , "لص" , "لط" , "لع" , "لف" , "لق" , "لك" , "لم" , "لن" , "لي" ,

        "مأ" , "مت" , "مج" , "مر" , "مل" , "من" , "مه" ,

        "نأ" , "نب" , "نت" , "نح" , "نخ" , "ند" , "نر" , "نس" , "نش" , "نص" , "نط" , "نع" , "نف" , "نق" , "نل" , "نم" , "نن" , "نه" , "نو" , "ني" ,

        "هب" , "هت" , "هج" , "هد" , "هر" , "هس" , "هش" , "هع" , "هل" , "هم" , "هن" , "هو" , "هي" ,

        "يد" , "يم"
    };

    public static readonly HashSet<string> MidYah = new()
    {
        "أب" , "أد" , "أر" , "أس" , "أض" , "أك" , "أل" , "أم" , "أن" ,

        "بت" , "بد" , "بض" , "بع" , "بن" ,

        "تح" , "تر" , "تس" , "تل" , "تم" , "ته" ,

        "جأ" , "جب" , "جر" , "جش" , "جف" , "جل" ,

        "حث" , "حد" , "حر" , "حز" , "حص" , "حض" , "حط" , "حف" , "حق" , "حك" , "حل" , "حن" , "حو" , "حي" ,

        "خب" , "خر" , "خس" , "خش" , "خط" , "خل" , "خم" ,

        "دث" , "در" , "دس" , "دك" , "دم" , "دن" ,

        "ذع" , "ذل" ,

        "رب" , "رث" , "رح" , "رس" , "رش" , "رض" , "رع" , "رف" , "رق" , "رل" , "رم" , "رن" , "ري" ,

        "زت" , "زح" , "زد" , "زر" , "زز" , "زغ" , "زف" , "زق" , "زل" , "زن" , "زي" ,

        "سأ" , "سب" , "سج" , "سح" , "سخ" , "سد" , "سر" , "سس" , "سف" , "سل" ,

        "شأ" , "شب" , "شت" , "شح" , "شخ" , "شد" , "شط" , "شع" , "شف" , "شق" , "شل" , "شم" , "شن" ,

        "صب" , "صح" , "صد" , "صر" , "صص" , "صع" , "صغ" , "صف" , "صم" , "صن" ,

        "ضر" , "ضع" , "ضف" , "ضق" , "ضم" ,

        "طب" , "طح" , "طر" , "طش" , "طع" , "طف" , "طن" ,

        "عب" , "عث" , "عد" , "عر" , "عس" , "عش" , "عط" , "عف" , "عل" , "عن" , "عه" , "عي" ,

        "غب" , "غث" , "غد" , "غر" , "غض" , "غط" , "غظ" , "غل" , "غم" , "غن" , "غي" ,

        "فأ" , "فح" , "فد" , "فش" , "فض" , "فظ" , "فف" , "فل" , "فن" ,

        "قأ" , "قح" , "قد" , "قر" , "قس" , "قش" , "قض" , "قظ" , "قف" , "قل" , "قم" , "قن" , "قي" ,

        "كد" , "كر" , "كس" , "كف" , "كل" , "كن" , "كي" ,

        "لث" , "لس" , "لف" , "لق" , "لل" , "لم" , "لن" , "لي" ,

        "مت" , "مح" , "مد" , "مر" , "مز" , "مس" , "مط" , "مع" , "مل" , "من" ,

        "نأ" , "نب" , "نح" , "نر" , "نع" , "نف" , "نق" , "نك" , "نل" , "نم" , "ني" ,

        "هأ" , "هب" , "هت" , "هج" , "هر" , "هش" , "هض" , "هط" , "هف" , "هل" , "هم" , "هن" ,

        "وب" , "ول"
    };

    #endregion Middle

    #region Last

    public static readonly HashSet<string> LastAlif = new()
    {
        "بر" , "تل" , "عد" , "صف" , "خط" , "قو" , "دن" , "عل" ,
        "دع" , "قص" , "حص" , "سو" , "أخ" , "حي" , "طر" , "أد" , "من" , "ند" , "أز" , "لغ" , "رخ"
    };

    public static readonly HashSet<string> LastHamza = new()
    {
        "بد" , "بذ" , "بر" , "بس" , "بط" , "بك" , "بو" ,

        "تن" ,

        "جر" , "جز" , "جس" , "جش" , "جف" , "جأ" ,

        "حد" , "حم" , "حن" ,

        "خب" , "خذ" , "خر" , "خس" , "خط" ,

        "در" , "دف" , "دن" , "دو" ,

        "ذر" ,

        "رب" , "رج" , "رد" , "رز" , "رف" , "رق" ,

        "زن" ,

        "سب" , "سل" , "سو" , "سي" ,

        "شط" , "شن" , "شي" ,

        "صب" , "صد" ,

        "ضو" ,

        "طر" , "طف" ,

        "ظم" ,

        "عب" ,

        "غو" ,

        "فت" , "فث" , "فج" , "فر" , "فق" , "في" ,

        "قث" , "قر" , "قم" , "قن" , "قي" ,

        "كل" , "كم" ,

        "لب" , "لج" , "لك" ,

        "مر" , "مل" , "من" , "مو" ,

        "نب" , "نت" , "نس" , "نش" , "نك" , "نو" , "ني" ,

        "هج" , "هد" , "هر" , "هز" , "هن" , "هي" ,

        "وب" , "وث" , "وض" , "وط" , "وك" , "وم"
    };

    public static readonly HashSet<string> LastMaksoura = new()
    {
        "كر", "رأ"
    };

    public static readonly HashSet<string> LastYah = new()
    {
        "أب" , "أت" , "أد" , "أذ" , "أز" , "أس" , "أق" , "أل" , "أن" , "أو" ,

        "بد" , "بر" , "بز" , "بط" , "بغ" , "بق" , "بك" , "بل" , "بن" , "به" ,

        "تق" , "تك" ,

        "ثد" , "ثر" , "ثن" , "ثو" ,

        "جب" , "جد" , "جر" , "جز" , "جل" , "جن" , "جه" , "جو" ,

        "حد" , "حذ" , "حر" , "حش" , "حص" , "حظ" , "حف" , "حك" , "حل" , "حم" , "حن" , "حو" , "حي" ,

        "خب" , "خز" , "خش" , "خص" , "خط" , "خف" , "خل" , "خن" , "خو" ,

        "دخ" , "در" , "دع" , "دف" , "دل" , "دم" , "دن" , "ده" , "دو" ,

        "ذر" , "ذك" , "ذم" , "ذو" ,

        "رأ" , "رب" , "رث" , "رج" , "رح" , "رخ" , "رد" , "رز" , "رض" , "رع" , "رق" , "رم" , "رن" , "رو" , "ري" ,

        "زب" , "زر" , "زك" , "زن" , "زو" , "زي" ,

        "سب" , "سج" , "سح" , "سخ" , "سد" , "سر" , "سع" , "سف" , "سق" , "سل" , "سم" , "سو" ,

        "شج" , "شر" , "شظ" , "شف" , "شق" , "شك" , "شه" , "شو" ,

        "صأ" , "صب" , "" , "صح" , "صد" , "صر" , "صغ" , "صف" , "صل" , "صم" ,

        "ضح" , "ضن" , "ضه" , "ضو" ,

        "طب" , "طخ" , "طر" , "طغ" , "طف" , "طق" , "طل" , "طم" , "طه" , "طو" ,

        "ظب" ,

        "عب" , "عت" , "عث" , "عذ" , "عر" , "عز" , "عس" , "عش" , "عص" , "عط" , "عظ" , "عل" , "عم" , "عن" , "عو" , "عي" ,

        "غب" , "غث" , "غد" , "غر" , "غو" , "غل" , "غم" , "غن" , "غو" , "غي" ,

        "فت" , "فد" , "فر" , "فص" , "فض" , "فع" , "فل" , "فن" ,

        "قد" , "قذ" , "قر" , "قص" , "قض" , "قع" , "قل" , "قن" , "قه" , "قو" , "قي" ,

        "كب" , "كخ" , "كد" , "كر" , "كس" , "كف" , "كل" , "كم" , "كن" , "كه" , "كو" , "كي" ,

        "لب" , "لح" , "لذ" , "لش" , "لظ" , "لق" , "له" , "لو" , "لي" ,

        "مح" , "مد" , "مر" , "مز" , "مس" , "مش" , "مض" , "مط" , "مع" , "مل" , "من" , "مه" ,

        "نأ" , "ند" , "نس" , "نع" , "نغ" , "نف" , "نق" , "نك" , "نم" , "نه" , "نو" , "ني" ,

        "هد" , "هذ" , "هر" , "هن" , "هو" ,

        "وت" , "وح" , "وخ" , "ود" , "ور" , "وز" , "وس" , "وش" , "وص" , "وط" , "وع" , "وغ" , "وف" , "وق" , "وك" , "ول" , "ون" , "وه"
    };

    #endregion Last
}
